Repository: dinhquydds/nanocucurmin
Catalog: tm/itiv1-level2.tmx
Source language: en_us
Languages: vi

source: Whereas osseointegration was the primary goal two decades ago, it is nowadays taken for granted and implants are expected to remain functional for decades.
vi: Trong khi tích hợp xương là mục tiêu chính của hai thập kỷ trước đây, ngày nay nó được cho là hiển nhiên và implant được mong đợi duy trì chức năng trong nhiều thập kỷ.

source: While the focus of this Treatment Guide is on the management of partially dentate patients, there must also be some brief consideration of the evolution and the rationale for the development of loading protocols for edentulous patients.
vi: Trong khi tập trung vào Hướng dẫn Điều trị là về quản lý của bệnh nhân mất răng bán phần, cũng có vài nhận xét quan trọng của sự tiến hóa và những lý do cho sự phát triển của quy trình tải lực cho bệnh nhân mất răng.

source: While the restoration itself can be enhanced by the expertise of the dental technician through office-laboratory communication, it is necessary for the restorative dentist to have a clear understanding of the materials and techniques involved in enhancing the soft-tissue response around the restoration.
vi: Trong khi phục hồi chính nó có thể được tăng cường bởi các chuyên gia của các kỹ thuật viên nha khoa thông qua giao tiếp văn phòng-phòng thí nghiệm, nó là cần thiết cho các nha sĩ phục hồi để có một sự hiểu biết rõ ràng về các vật liệu và kỹ thuật liên quan đến việc tăng cường các phản ứng mô mềm xung quanh việc phục hồi.

source: Wide Neck implants, with their 6.5-mm shoulder diameter, are not recommended for use in the anterior maxilla.
vi: Implant cổ rộng, đường kính vai 6.5mm, không được khuyến cáo cho phía trước hàm trên.

source: Width of edentulous span
vi: Chiều rộng khoảng mất răng

source: Width of the Hard and Soft Tissues in the Edentulous Space
vi: Chiều rộng của mô cứng và mô mềm trong khoảng mất răng

source: Width of the facial keratinized mucosa
vi: Chiều rộng của niêm mạc sừng hoá

source: Width of the hard and soft tissues in the edentulous space
vi: Chiều rộng của mô cứng và mô mềm trong khoảng mất răng

source: With a synOcta impression cap in place, the lack of peri-implant tissue support was evident in the interproximal areas (Fig 25).
vi: With a synOcta impression cap in place, the lack of peri-implant tissue support was evident in the interproximal areas (Hình 25).

source: With indirect occlusion, the implant is restored without directly contacting the opposing dentition, i.e. it is out of occlusion.
vi: Với khớp cắn gián tiếp, implant được phục hình không tiếp xúc cắn khớp trực tiếp với hàm đối diện, vd nó không tiếp xúc cắn khớp.

source: With progressive loading, the implant is restored in “light” contact initially and is gradually brought into full contact with the opposing dentition.
vi: Với tải lực tăng dần, implant được phục hồi với tiếp xúc "nhẹ" ban đầu và tăng dần tới tiếp xúc đầy đủ với hàm đối diện

source: With regard to implant success, high-risk patients should be informed of the challenges associated with the treatment.
vi: Liên quan đến sự thành công cấy ghép với các bệnh nhân có nguy cơ cao cần được thông báo về những khó khăn liên quan đến việc điều trị.

source: With the custom impression cap in place, a polyvinyl siloxane impression was taken (Fig 28).
vi: With the custom impression cap in place, a polyvinyl siloxane impression was taken (Hình 28).

source: With the esthetic outcome strongly influenced by the final gingival architecture, the risk can be reduced by the presence of square teeth (and, often, a thick-gingiva biotype).
vi: Với kết quả thẩm mỹ chịu ảnh hưởng mạnh mẽ bởi các cấu trúc nướu sau cùng, nguy cơ có thể được giảm bởi sự có mặt của răng vuông (và thường là một dạng sinh học nướu dày).

source: With the exception of Fig 13a in section 4.7 and Figs 6, 7, 23, 24, 25, 27, 29, 30a, 30b, 31, 32, 33, 34, and 37 in section 5, the components of the implant system shown are part of the Straumann® Dental Implant System.
vi: With the exception of Hình 13a in section 4.7 and Hình 6, 7, 23, 24, 25, 27, 29, 30a, 30b, 31, 32, 33, 34, and 37 in section 5, the components of the implant system shown are part of the Straumann® Dental Implant System.

source: With the loss of the interproximal crest height comes a reduction in papillary height.
vi: Với sự mất chiều cao mào xương mặt bên làm giảm chiều cao nhú nướu.

source: With the tooth to be extracted still in place, the laboratory technician precisely anticipated on the study cast the local site configuration expected after tooth removal.
vi: With the tooth to be extracted still in place, the laboratory technician precisely anticipated on the study cast the local site conHìnhuration expected after tooth removal.

source: With the understanding that the literature base is small and the strength of evidence graded as inadequate to fair, the group reached the following conclusions with regard to loading protocols for endosseous dental implants in 2003:
vi: Với sự hiểu biết rằng dựa trên y văn thì nhỏ và sức mạnh của bằng chứng được xếp loại không đủ, nhóm đã đạt được những kết luận sau có liên quan đến quy trình tải lực cho implant trong xương năm 2003:

source: Working Group 2, exploring the topic of “Esthetics in Implant Dentistry,” consisted of the following ITI fellows:
vi: Nhóm làm việc 2, khám phá chủ đề "thẩm mỹ trong cấy ghép nha khoa", bao gồm các nghiên cứu sinh sau ITI sau đây:

source: Yet, the majority of the information cannot be scientifically analyzed.
vi: Tuy nhiên, phần lớn các thông tin không thể được phân tích khoa học.

source: “... to promote and disseminate knowledge on all aspects of implant dentistry and related tissue regeneration through research, development and education to the benefit of the patient.”
vi: “... để thúc đẩy và phổ biến kiến thức về tất cả các khía cạnh của nha khoa cấy ghép và tái tạo mô liên quan thông qua nghiên cứu, phát triển và giáo dục vì lợi ích của bệnh nhân.”

source: …on a framework that rigidly connects the implants.
vi: …trên một khung sườn kết nối cứng chắc các implant

source: …supported by a bar connecting the implants or by unconnected implants, with implants characterized by a rough titanium surface and allowed to heal for at least 6 weeks, in a site characterized by type 1, 2 or 3 bone.
vi: …nâng đỡ bởi một thanh kết nối các implant hoặc bởi các implant không được kết nối, với đặc điểm implant có bề mặt titanium nhám và cho phép lành thương ít nhất 6 tuần, trong vùng cấy ghép có xương loại 1, 2 hoặc 3.

source: …supported by a bar connecting the implants or by unconnected implants, with implants characterized by a rough titanium surface and allowed to heal for at least 6 weeks.
vi: …nâng đỡ bởi một thanh kết nối các implant hoặc bởi các implant không được kết nối, với đặc điểm implant có bề mặt titanium nhám và cho phép lành thương ít nhất 6 tuần

source: ≤ 5 mm to contact point
vi: ≤ 5 mm đến điểm tiếp xúc

source: ≥ 7 mm to contact point
vi: ≥ 7 mm đến điểm tiếp xúc
